Revit 2027 API
ExternallyTaggedGeometryValidation.LacksSubnodes Method
 Makes sure that the input geometry object does not have sub-nodes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool LacksSubnodes(
	GeometryObject geometry
)
Public Shared Function LacksSubnodes (
	geometry As GeometryObject
) As Boolean
public:
static bool LacksSubnodes(
	GeometryObject^ geometry
)
static member LacksSubnodes :
        geometry : GeometryObject -> bool
Parameters
geometry GeometryObject
 Geometry object to be validated.
Return Value
Boolean
 True if the supplied geometry object does not have sub-nodes.
See Also
Reference
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace